tests/load/reports/k6-summary-2025-08-19T22-03-18-382Z.txt
      ✓ init json status 200
      ✓ init json body has jsonrpc
      ✓ list json status 200
      ✓ list json body has jsonrpc
      ✓ call json status 200
      ✓ call json body has jsonrpc
      ✓ init sse status 200
      ✗ init sse content-type
       ↳  0% — ✓ 0 / ✗ 5440
      ✗ init sse body has data frame
       ↳  0% — ✓ 0 / ✗ 5440

    ✗ checks.........................: 77.77%  ✓ 38080      ✗ 10880
      data_received..................: 7.9 MB  263 kB/s
      data_sent......................: 5.1 MB  171 kB/s
      http_req_blocked...............: avg=4.85µs   min=0s       med=2µs      max=3.95ms   p(90)=5µs      p(95)=7µs     
      http_req_connecting............: avg=420ns    min=0s       med=0s       max=570µs    p(90)=0s       p(95)=0s      
      http_req_duration..............: avg=2.38ms   min=56µs     med=2.02ms   max=13.57ms  p(90)=4.6ms    p(95)=5.52ms  
        { expected_response:true }...: avg=2.38ms   min=56µs     med=2.02ms   max=13.57ms  p(90)=4.6ms    p(95)=5.52ms  
      http_req_failed................: 0.00%   ✓ 0          ✗ 21760
      http_req_receiving.............: avg=21.9µs   min=2µs      med=14µs     max=1.94ms   p(90)=37µs     p(95)=57µs    
      http_req_sending...............: avg=23.91µs  min=1µs      med=7µs      max=4.98ms   p(90)=22µs     p(95)=47µs    
      http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
      http_req_waiting...............: avg=2.33ms   min=50µs     med=1.98ms   max=13.55ms  p(90)=4.51ms   p(95)=5.4ms   
      http_reqs......................: 21760   722.859275/s
      iteration_duration.............: avg=110.64ms min=100.81ms med=111.09ms max=122.68ms p(90)=113.57ms p(95)=114.26ms
      iterations.....................: 5440    180.714819/s
      rpc_errors.....................: 100.00% ✓ 5440       ✗ 0    
      rpc_initialize_json_ms.........: avg=3.865277 min=0.089    med=3.738    max=13.575   p(90)=6.1753   p(95)=7.0721  
      rpc_initialize_sse_ms..........: avg=1.09193  min=0.056    med=1.125    max=4.708    p(90)=1.984    p(95)=2.1952  
      rpc_tools_call_json_ms.........: avg=1.889723 min=0.112    med=1.819    max=5.99     p(90)=3.023    p(95)=3.4502  
      rpc_tools_list_json_ms.........: avg=2.681493 min=0.093    med=2.531    max=8.319    p(90)=4.55     p(95)=5.28435 
      vus............................: 20      min=20       max=20 
      vus_max........................: 20      min=20       max=20